Repository: atlas-studios/ForcedExposureDailyAfterRebirth
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 只是想着秦柔这么关心自己，自己却不顺从着她的话，好像是不太好，所以即使是不喜欢，也装出了一副很满意的模样。
en_us: However, she used to comply and pretend that she was pleased with the meals because she felt that it would be inappropriate to defy Qin Rou who had always showed her concern and doted on her.

source: 只是想着自家就这么一个宝贝女儿，自己人都没打过她，却被别人这么欺负，他这心里也是怒火中烧，点头认同道：“行，爸爸就听你的。”
en_us: However, as he thought about how no one from his family had ever hit or bullied his precious daughter, his heart was filled with infuriation and he agreed with a nod, "Okay, we'll go ahead with that."

source: 只是母亲的气质很温柔，丝毫没有因为这双眼睛，而让人觉得魅惑。
en_us: However, her mother had a gentle temperament and she did not seem sultry because of her eyes.

source: 只是没想到徐晗会拆台，说她欺负人？
en_us: However, she did not expect Xu Han to embarrass her and call her a bully.

source: 只是没想到这丫头下手这么狠，两个女生被她压着打成了那般。
en_us: However, he did not expect her to be so ruthless as to beat those two girls up to such an extent.

source: 只是没想到，会在门口看到了徐凤年的车。
en_us: However, they did not expect to see Xu Fengnian's car at the entrance.

source: 只是笑容淡了。
en_us: However, her smile faded.

source: 只是胖的比较慢，叶漓并没有放心上，只当是因为自己平时贪吃导致，从来没有往其他地方联想。
en_us: However, Ye Li did not pay much attention to her weight gain because it was slow and gradual. She simply thought that it was caused by her gluttony and penchant for eating. Hence, she did not think of other reasons.

source: 只是自家哥哥一举一动都很容易被狗仔拍到，更别说这样劲爆的大新闻。
en_us: However, the paparazzi would easily capture every single move of her brother. Besides, the news this time was groundbreaking.

source: 只是这个大明星，这会儿脸色也不大好。
en_us: However, the celebrity now had a sullen expression.

source: 只是这么多钱，叶眉气的额角突突突的疼。
en_us: However, the staggering amount of money was making her forehead prob.

source: 只是这对于已经二十八岁的叶漓来说，简直就是上天的恩赐。
en_us: However, that was a gift from God Ye Li, who was already 28 years old.

source: 只是，叶眉虽然同他们是同父异母，关系不是很亲，但是从小乖巧，也是三人看着长大的人，怎么也不敢想她会传播出这样的事情。
en_us: Although Ye Mei was their half-sister whom they were not very close to, they had watched her grow up and she had always been obedient since she was a child. They never expected that she would spread the news about this matter.

source: 只有叶家自己人知道，这都是为了自家妹妹不受欺负。
en_us: The members of the Ye Family were the only ones who knew that it was because he did not want Ye Li to be bullied.

source: 只有才上大学的新生们会经常穿。
en_us: Only the freshmen would wear the school uniform all the time.

source: 只有跟着的两个女生觉得有些丢人，“叶眉今天搞什么啊？怎么带了一张空卡过来，等会不会不给咱们付钱吧，早知道我就不买了，丢死人了。”
en_us: The two girls in front felt a little embarrassed and they asked, "Ye Mei, what's the matter with you today? Why did you come here with an empty card? Will you not pay for us later? If I knew earlier, I wouldn't have bought it. This is so embarrassing."

source: 只要是因为她的事情，他们都很难去沉下心思考，都会失去理智。
en_us: Whenever it comes to matters related to her, they would find it hard to think straight and would often become irrational.

source: 只要是面对妹妹，叶枫的大脑都是处于停止思考的状态。
en_us: Whenever he faced his younger sister, Ye Feng's mind would turn blank and he would stop thinking.

source: 只要那些人开口，校长之位随时就可以换人。
en_us: With a single word of theirs, the principal could be replaced easily.

source: 可一旦叶漓承认了，被人发到了网上，那她即将承受的，可不仅仅是同学们的怒火，而是于向阳那几百万的粉丝的疯狂报复。
en_us: However, once Ye Li admitted it and the matter was posted on the Internet, she would immediately have to suffer the revenge of Yu Xiangyang's millions of fans, in addition to the rage of her classmates.

source: 可三兄弟一同出现，这还是大家头一次见。
en_us: However, it was their first time seeing the three brothers appearing together.

source: 可上辈子，自己为什么不知道他的存在？？
en_us: 'But why didn't I know about his existence in my previous life?'

source: 可上面的公章确实是徐家的公章没错，怎么会有两个呢？
en_us: 'However, the seal is indeed the Xu Family's official seal. Why are there two?'

source: 可下一秒，众人傻眼了。
en_us: However, they were dumbfounded at the next second.

source: 可下面的监控清清楚楚的放了出来，这种大品牌店铺很注重这些细节，就连监控也是清清楚楚，以至于当时的场面，叶眉对导购的不耐态度，都被大家清清楚楚的看在了眼里。
en_us: However, the truth was clearly shown in the footage. Major luxury brands like YS Fashion would place a lot of emphasis on details and even the definition of their surveillance camera footages was crystal clear. Everyone saw the annoyance and hostile attitude that Ye Mei had when she was facing the sales assistant.

source: 可不管是不是，自家的妹妹不能白受了这个委屈。
en_us: However, regardless of whether she was the one who spread it or not, they would never let their younger sister be mistreated that way.

source: 可为什么？
en_us: 'But why?'

source: 可之前他明明就听说了她为这件事自杀。
en_us: However, he had clearly heard that she attempted suicide because of that matter.

source: 可二十岁之后，家中的人因为已故母亲当初同好姐妹徐家大夫人曾定下的娃娃亲，非要让她同那个冷冰冰的男人订婚，彼时，叶漓已近有了心仪之人，又怎会愿意。
en_us: After Ye Li reached the age of twenty, her family insisted that she marry the cold and unfeeling man from the Xu Family, because her late mother had betrothed her to the son of her best friend, the matriarch of the Xu Family, ever since they were children. However, Ye Li was already in love with someone else. How could she have agreed to it?

source: 可于向阳的脸色就没那么好了。
en_us: Yu Xiangyang's expression was sullen.

source: 可人家丝毫没有注意到她。
en_us: However, she did not notice him at all.

source: 可人家都这么说了，她总不能不换下来还人家吧。
en_us: However, since they've already said that, she had no choice but to remove it and return it.

source: 可今儿个却告诉他们，她看上了对方。
en_us: Yet, she told them today that she had fallen for him.

source: 可今儿个她说的那些话，可是彻底得罪她叶漓了！
en_us: However, Cheng Yan's words had completely offended Ye Li!

source: 可今儿个是怎么了，一直帮着外人说话，让叶漓道歉，还变相的告诉大家，就是叶漓的错，真是奇了怪了。
en_us: However, she seemed to be continuously standing up for outsiders today and making Ye Li apologize. That was indirectly telling others that it was Ye Li's fault, which was rather strange.

source: 可今儿个的叶漓，他竟然看不懂了。
en_us: However, he did not understand the current Ye Li.

source: 可今天竟然说出这样一番话，还用那样嫌恶仿佛在看垃圾一样的眼神。
en_us: However, she said such shocking words today and even looked at him like she was looking at garbage.

source: 可今天这自家妹妹确实也没说什么，一直都是她在那里说，这会儿还委屈上了，阿漓说得对，她有什么好委屈的，当事人都不委屈呢，做出一副被人欺负的模样给谁看，真当他们是瞎的？
en_us: However, their younger sister really did not say anything today and Ye Mei was the one who was rattling on and on continuously. Yet, she was acting like she was mistreated. 'Li is right. What is there for her to be aggrieved about? Even Li, the person involved, is not feeling aggrieved. Ye Mei is pretending like she's gotten bullied. Does she think we're blind?'

source: 可今天，她突然顿悟。
en_us: However, she suddenly had an epiphany today.

source: 可从查到的消息来看，叶漓并不具备能威胁到她的能力。
en_us: However, according to the information she found, Ye Li did not have the abilities to threaten her.

source: 可仔细想，他们的妹妹何时怕过他们？
en_us: However, they thought about it carefully and realized that Ye Li had never been afraid of them before.

source: 可他跟她又没什么关系，之前这丫头还讨厌自己的要死，他也不好多问。
en_us: However, he had nothing to do with her and she even hated him previously. Hence, he decided not to ask any further.

source: 可他还是维持着担忧的表情，只是有些僵硬。
en_us: However, he continued to maintain a worried expression, though it was somewhat stiff.

source: 可以说，他有今天的成就，少不了叶枫的帮忙。
en_us: It was fair to say that he owed part of his success to Ye Feng's help.

source: 可低垂的眸中，却带着几分疑惑。
en_us: However, there was some puzzlement in her eyes when she was looking down.

source: 可具体到底是哪里出了变了，她也看不出来。
en_us: However, she could not put a finger on what exactly changed.

source: 可再怎么样，他也比不过自己妹妹重要。
en_us: However, no matter what, his younger sister was far more important than Yu Xiangyang.

source: 可再怎么样，他也没有如今这么不知所措。
en_us: However, no matter what, he was not as helpless as he was today.

source: 可刚刚她却那样做了，是真的因为担心，还是别有用意？
en_us: However, she actually did that just now. Was she really just worried or does she have an ulterior motive?

source: 可别人已经开口赶人，他总不能死赖着不走吧！
en_us: However, since they had already made it clear that they wanted him to leave, he couldn't insist on staying behind!

source: 可到了最后才知道，原来自己最讨厌的人，才是真正宠她入骨的。
en_us: However, she only found out in the end that the people whom she hated the most were actually the ones who truly spoiled her to bits.

source: 可到底为什么，自己不过是拒绝了她一次，之前又不是没有拒绝过，为什么就这次的反应这般大！
en_us: 'But why? I've only rejected her once recently and it's not like I haven't rejected her before in the past. Why is she having such a huge reaction this time!?!'

source: 可到底目的地，都呆住了。
en_us: However, they were all dumbfounded when they reached the restaurant.

source: 可即使是这样，大家还是都记住了她。
en_us: However, even then, everyone still remembered her.

source: 可即使是这样，还是让一众粉丝们惊呆。
en_us: However, even then, the fans were still astonished.

source: 可却没想到，自己遭受的这一切，都是她在背后所策划。
en_us: However, she didn't expect that Ye Mei was the one who caused all her torment.

source: 可可回复野王的女人：“就是，太不要脸了，咱们枫神怎么就愿意跟这样的人吃饭，她到底用了什么手段啊！气死我了，意难平！！！”
en_us: Replying to Wild King's Woman, Coco: "Exactly, she's relly shameless. How can Ye Feng be willing to have a meal with such a person? What trick did she pull!?! I'm so enraged, I can't get over it!!!"

source: 可可爱爱：“你这么好的一个人，怎么就有了那样不知廉耻的姐姐呢？心疼眉宝。”
en_us: Adorable and Lovely: "You're such a nice girl, why do you have such a shameless sister? My heart goes out to you, Ye Mei."

source: 可叶家的千金小姐在学校里呆了这么久，为什么没有丝毫风声。
en_us: However, why weren't there any rumors about her background throughout all the years that she had been in school?

source: 可叶枫和他关系闹崩了之后，大家都以为他得罪了这位大神。
en_us: However, after he fell out with Ye Feng, everyone thought he had offended the godly Ye Feng.

source: 可叶漓距离至今，不过几个小时，这粉丝数就快超过她了。
en_us: However, within just a few hours, Ye Li was almost going to have more followers than her.

source: 可叶漓这么一说，大家顿时就感觉到了另一层的深意。
en_us: However, once Ye Li said so, everyone immediately felt that there was another meaning to her words.

source: 可叶漓都不在，自然也就没有过来的必要。
en_us: Since Ye Li was not around, there was no need for them to show up either.

source: 可叶眉又是谁，她不是说自己是叶家小姐吗？
en_us: 'Who is Ye Mei then? Didn't she say that she's also the daughter of the Ye Family?'

source: 可听到后面一句，嘴角就已经控制不住的上扬了起来。
en_us: However, when she heard the latter sentence, she couldn't help but smile and beam with joy.

source: 可在叶漓看来，她们就跟孟非一样愚蠢。
en_us: However, in Ye Li's opinion they were just as foolish as Meng Fei.

source: 可在她几乎要忘记的时候，叶漓却毫不留情的狠狠拔了出来，鲜血淋漓！疼的她直发抖。
en_us: However, just as she was about to forget about it, Ye Li pulled the thorn out mercilessly, causing her to bleed! She was in so much agony that she began shuddering.

source: 可在妹妹面前，他们却卑微到了骨子里。
en_us: However, in front of their younger sister, they would swallow their pride and were extremely humble.

source: 可她却笑了，笑的十分灿烂，“可以啊，这点小事，只是我的卡没带，你先跟我回去一趟吧，我给你拿卡。”
en_us: However, smiled radiantly and said, "Sure, that's a trivial matter. However, I forgot to bring my card out with me. Let's go home first, I'll get the card for you."

source: 可她就是下意识的控制不住自己，看到他的瞬间，就想叫了，根本就没怎么思考。
en_us: However, she just subconsciously couldn't control herself. She wanted to scream the moment she saw him and she didn't think about it at all.

source: 可她自始至终好似都那么淡定。
en_us: However, she had been maintaining her composure since the start.

source: 可她还是强忍着不甘心，赶忙跟了上去。
en_us: However, she suppressed her indignation and hurriedly followed them.

source: 可她还没高兴多久，事情逐渐就开始不受掌控了。
en_us: However, her happiness was short-lived as things gradually began to get out of her control.

source: 可她那时候却不知道，叶眉只是将她当做了个提款机。
en_us: However, she did not know at that time that Ye Mei was merely using her as an ATM machine.

source: 可如今再次看到这个女孩，他之前那些感觉，全推翻了。
en_us: However, after seeing her this time, he changed his impression of her.

source: 可如今叶漓亲口所说，那势必是不会有假。
en_us: However, after hearing it straight to the horse's mouth, it was definitely real.

source: 可如今眼前这个宛如恶魔一样的女孩，却能在做出这样恐怖的事情之后，还能笑出来，比学校那些混社会的学生还要可怕数倍。
en_us: However, she was now acting like a demon who could laugh even after having done such a terrifying thing. They found her to be several more times terrifying than those students who were gangsters.

source: 可妹妹如今不愿意。
en_us: However, Ye Li was unwilling to forgive him.

source: 可妹妹让他下来接她的时候，他就没多想，直接下来了。
en_us: However, when his younger sister told him to go downstairs to receive her, he immediately agreed without hesitation.

source: 可实际那样的发型在现在这个时代，是最土的。
en_us: However, in this current day and age, her previous hairstyle was already outdated and tacky.

source: 可对于如今的她又不是傻子。
en_us: However, she was no longer a fool.

source: 可就在这个时候，一穿着西装的女人走了出来，歉意的朝她说道：“抱歉在这位小姐，这条夏夜之星的礼服已经被人从网上定下了，所以麻烦您....”
en_us: However, at this moment, a woman in a suit came out and said to her apologetically, "Miss, sorry, but the Stars of the Summer Night dress has already been purchased by someone online, so please..."

source: 可就在这个时候，叶漓又十分嚣张的发了一条微博：“我就是喜欢看你们看不惯我却又干不掉我的样子，还有，鱼很好吃。”下面配了两张图片，一张是饭菜的图片，一张是叶枫认真挑刺的图片。
en_us: However, at this moment, Ye Feng posted another tweet. "I just like watching you guys hate on me while being unable to get rid of me. Also, the fish is delicious." She attached two more photos, one of which was of the dishes and another was of Ye Feng attentively picking out the fish bones for her.

source: 可就是这样一个二十岁的女孩子，却有着一颗比叶眉还要贪婪的心。
en_us: However, the 20-year-old girl had a heart that was even greedier than Ye Mei's.

source: 可就是这样一个男人，在自己失去一切之后，当着所有记者的面说和她不熟。
en_us: However, he was also the same man who told all the reporters that he did not know her well after she lost everything.

source: 可就是这样三个气场惊人，难以接近的大佬，此时竟围着一女孩打转。
en_us: However, there were many girls around the three big shots who had terrifying and domineering auras, and were hard to approach.

source: 可当事人却好几天没来学校，不知道是不是觉得丢人还是什么原因。
en_us: However, Ye Mei was absent from school for several consecutive days, perhaps because she was embarrassed or some other reason.

source: 可当他们看到叶漓坐到最后那个位置的时候，说这话的嘴巴都不约而同的停了下来。
en_us: However, when they saw Ye Li sitting down at her seat, they stopped unanimously.

source: 可当众粉丝们看到这条微博的时候，都惊呆了。
en_us: However, his fans were dumbfounded when they read it.

source: 可当叶漓拨出电话叫哥哥两个字的时候，她就慌了。
en_us: However, she panicked when she heard Ye Li talking to Ye Feng on the phone.

source: 可当看到从车内走下叶漓的身影时，叶眉的脸色猛地一下就沉了。
en_us: However, when she saw Ye Li getting out of the car, Ye Mei's face grew sullen immediately.

source: 可很快他们就知道叶漓为什么会@ys的官方了。
en_us: However, they soon understood why Ye Li tagged the official Twitter account of the luxury fashion label.

source: 可很快的，大家叫不出来了。
en_us: However, they soon fell speechless.

source: 可徐凤年借佛献花，让她那一点不快瞬间消失了个一干二净。
en_us: However, Xu Fengnian's sweet gesture made her displeasure vanish completely.

source: 可徐凤年并没有注意到她的目光，反倒是看着身旁已经有些不耐烦的小人，微微皱了皱眉，说道：“累了吗？”
en_us: However, Xu Fengnian did not notice the gaze in her eyes. Instead, he looked at Ye Li who was extremely annoyed. Frowning slightly, he asked, "Are you tired?"

source: 可徐凤年的手却没有离开。
en_us: However, Xu Fengnian did not move his hand away.

source: 可徐晗坐在那里，这岂不是代表着，他也是徐家家族的人？
en_us: Didn't that mean that Xu Han was also a member of the family?

source: 可心里不知为什么，突然就涌出了一抹恐慌。
en_us: However, a sudden horror surged in her heart for some reason.

source: 可惜依旧记不得叫什么了，就感觉对方突然走到她的身后坐下，那动静大的直接掀起了一阵风，吹乱了她的发丝。
en_us: Unfortunately, she could no longer remember their names and she felt that he had suddenly walked over and sat down behind her. His actions caused a gust of wind to blow up and mess up her hair.

source: 可惜对面的孟父毫不自知，还以为他是怕了，抬起了下巴，高高在上的冷哼一声：“怕了吧，怕了就给我识相点！耽误了老子的时间，你们可赔不起！”
en_us: Unfortunately, Meng Fei's father had no idea at all. Thinking that Ye Feng was scared, he raised his chin, and humphed condescendingly. "You're scared, aren't you? Since you're scared, you'd better behave yourself! You can't afford to compensate me for wasting my time!"

source: 可想了想，即使这么多情敌，上辈子的徐凤年也未曾对不起过她半分。
en_us: However, she thought about it and realized that even with so many love rivals, Xu Fengnian had never done anything to wrong her in her previous life.

source: 可想到她被欺负了，心里更多的是怒气，于是乎问：“没事吧？”
en_us: However, at the thought of her getting bullied made him infuriated. Hence, he asked, "Is everything okay?"

source: 可据他了解，叶家只有一个小姐，那叶漓又是谁？
en_us: However, according to his understanding, there was only one daughter of the Ye Family. Who was Ye Li then?

source: 可接下来的场面，却让这个天塌下来也泰然自若的男人眼皮狠狠一跳。
en_us: However, what happened next caused the eyelids of the man, who would remain composed even if the sky fell down, to twitch.

source: 可旁边这个，是叶漓？
en_us: 'Is this girl beside her Ye Li?'

source: 可无论她如何做，徐凤年对她的态度，都从始至终的冷淡。
en_us: However, no matter what she did, Xu Fengnian's attitude towards her had always remained aloof since the beginning.

source: 可是想到刚刚自己还偷偷骂过人家，这会是怎么也不好意思惦着脸上去说话。
en_us: However, at the thought of the fact that they had just secretly scolded Ye Li just now, they found it too embarrassing to go forth and speak to her.

source: 可服务员却道：“抱歉小姐，你这张卡余额不足，并不足够买这款夏夜之星的晚礼服。”
en_us: However, the waitress said, "I'm sorry, Miss, the remaining credit limit in your card is insufficient for the purchase of the Stars of the Summer Night gown."

source: 可枫神出现的比较少，也没听说过他和叶眉接触过啊？
en_us: 'However, Ye Feng rarely appears in school and there hasn't been news of him being in contact with Ye Mei.'

source: 可楼上偷偷看着这一幕的叶眉气的脸都扭曲了。
en_us: However, Ye Mei who was secretly watching everything upstairs, was so exasperated that she had begun grimacing.

source: 可此时男人冷峻的脸上，却带着几分惊愕，他手中的手机，差点就因耳旁响起的那一句话，从手中滑落.....
en_us: However, there was some shock on his handsome face now. He almost dropped his mobile phone that he was holding in his hand, because of the alarming words of hers...

source: 可每一次听，他的心里都久久无法平静。
en_us: However, every time he heard it, his heart would get jittery for a long time.

source: 可现在却多了不少关于叶漓的评论。
en_us: However, many of the comments were now about Ye Li.

source: 可现在又出了个叶漓，而且舅妈对她明显很热络，就连爷爷也很喜欢她的样子，还安排她坐在了表哥身边。
en_us: However, Ye Li had appeared and she seemed to be very close to Mrs. Xu. She was also adored by Xu Fengnian's grandfather who arranged for her to sit beside Xu Fengnian.

source: 可现在看来，自己好像是还遇到了意外之喜了。
en_us: However, it seemed that she had stumbled on an unexpected joy now.

source: 可现在，她暗暗冷笑，垂眸看了某个男人发来的消息一眼，回道：“是吗？我觉得挺好看的呀。”
en_us: However, now, she sneered and looked down to take a glance at the text message that she received from a certain man. "Is that so? I think it looks great."

source: 可眼前这个女孩子，虽然胖是胖，但是给人的感觉却完全不一样。
en_us: Although the girl in front of them was chubby, she gave off a completely different vibe.

source: 可确实，当时她没有在现场， 并不知道到底发生了什么，也只是听说而已，谁料想今天的叶漓竟然这么会说，三言两语就把自己洗白了，她如今和叶漓关系还好，再说下去，恐是会让她怀疑。
en_us: However, it was true that she wasn't at the scene at the time and had no idea what happened. She had merely heard everything based on hearsay. To her surprise, Ye Li actually said those words today and effortlessly cleared her own name. Her relationship with Ye Li was still cordial for now and if she went on to talk about that, she might really arouse Ye Li's suspicion.

source: 可细听才知道内里的嘲讽之意。
en_us: However, she was obviously mocking her.

source: 可能不是很熟悉叶枫和叶旬。
en_us: They might not know Ye Xun and Ye Feng well.

source: 可能是因为太闷，女孩的小脸通红通红，发丝凌乱的像是刚被人狠狠欺负过一样。
en_us: Perhaps because it had been too stuffy under his blazer, her face turned red and her hair was all messed up. She looked like she had just been bullied.

source: 可能是圆润的原因，胸也比同龄人看起来大。
en_us: Perhaps because of her chubbiness, she was much more well-endowed compared to other girls her age.

source: 可能这个汇演，会在提前一个星期告知大家。
en_us: Perhaps, the students would be informed of the performance a week in advance.

source: 可能这辈子也没向人低过头，这会儿难以接受吧。
en_us: She probably found it hard to accept it because she had never bowed down to others before in her life thus far.

source: 可自己从小乖巧懂事，都无法得到别人一丝一毫的目光。
en_us: Yet, no one bothered to pay attention to Ye Mei at all even though she had always been obedient and sensible ever since she was a child.

source: 可自己同样是叶家的女儿，却被生疏的叫做叶眉小姐？
en_us: Yet, she addressed Ye Mei as 'Miss Ye Mei' even though she was also the daughter of the Ye Family.

source: 可若是不让面前这两兄妹满意，自己毕生的心血就因为这么点事毁于一旦，他又如何能甘心！
en_us: However, if he did not satisfy Ye Li and Ye Feng's wishes, that would be the end of his lifelong career. How could he be willing to accept that!?!

source: 可若是这是梦，他希望永远都不要醒来。
en_us: However, if it was a dream, he hoped that he would never wake up.

source: 可莫名的拨动人心。
en_us: However, she somehow made his heart flutter.

source: 可覆水难收，她对他的误会太深，恨意早已压垮了那仅仅剩余的一丝情谊。
en_us: However, what was done could not be undone. She had misunderstood him greatly in the past and her hatred for him had already overwhelmed the last bit of feelings that she had for him.

source: 可见年轻的时候，是怎样一个极品。
en_us: He was clearly a dreamboat when he was younger.

source: 可见的，压抑的气氛却缓和了不少。
en_us: Clearly, most of the oppressive tension in the air had eased up.

source: 可话中的意思却变相的告诉大家，叶漓是没见过世面，所以才会这样不知好歹！
en_us: However, in other words, she was indirectly telling everyone that Ye Li was acting so callously because she had never been to such major events before.

source: 可谁让她们欺负了他的丫头，那就别怪他不客气了。
en_us: However, since they bullied his girl, they shouldn't blame him for being hostile.

source: 可越是这样的学校就越是管得严格。
en_us: However, such schools had stricter rules.

source: 可跟在她身后的小姐们就忍不住了：“你谁啊？没见二小姐跟你打招呼吗？怎么就这个态度！”
en_us: However, the ladies behind her couldn't hold it back any longer. "Who are you? Can't you see that Miss Xu Yuan is greeting you? What's with that attitude of yours!?!"

source: 可车停了半响，车上也未见有人下车，这让大家不禁有些疑惑。
en_us: However, no one alighted from the car even after it had stopped for a while, which made everyone else feel somewhat confused.

source: 可这个没什么记忆的少年，却精准的认出她？
en_us: Yet, this young man whom she had a vague impression of, actually managed to recognize her accurately.

source: 可这件事距离此时已近过去了八年，又怎会再现？
en_us: However, it had been eight years since that incident occurred. Why did this scene appear again?

source: 可这会儿却仿佛什么事情都没发生一样。
en_us: However she was acting like nothing happened now.

source: 可这会儿却掩都掩不住，很明显是有什么很开心的事情。
en_us: However, he couldn't hide his joy now and he was obviously elated about something.

source: 可这会儿却连看也不想多看一眼。
en_us: However, today, they did not want to take another glance at her at all.

source: 可这会儿平淡的像是什么也没发生一般，根本就没将这个称呼放在心上。
en_us: 'But this time, she's so composed, like nothing had happened. She doesn't take it to heart at all.'

source: 可这会儿看到跟着的几个男人，还是没忍住惊艳。
en_us: However, after seeing the few men now, she couldn't help but be amazed.

source: 可这会儿，因为一个叶漓，大家看他的眼神只剩下了冰冷。
en_us: However, now everyone looked at him coldly because of Ye Li.

source: 可这对他们来说，却更为反常，不由的担忧对视一眼，作为大哥的叶洛先开了口，“阿漓，让你和徐凤年订婚是我们的不对，以后万不可再做傻事了好不好？”
en_us: However, to them, they felt that she was acting out of the ordinary. They couldn't help but look at each other worriedly. The eldest brother, Ye Luo, was the first to speak. "Li, it was wrong of us to make you get engaged to Xu Fengnian back then. Don't do anything stupid in the future again, alright?"

source: 可这幅怪异的表情落到三人眼中，又是一阵疑惑。
en_us: However, the three men were confused again when they saw her peculiar expression.

source: 可这是一回事，被叶漓当面说出来就是另一回事了。
en_us: However, it was one thing for him to know it himself, and another for Ye Li to spell it out loud.

source: 可这样一个男人，在知道她身份之后，竟然也不像是其他人那样讨好她顺着她，甚至对她嗤之以鼻，冷漠相对。
en_us: However, after discovering her identity, a man like him actually despised her and treated her coldly with disdain and contempt, unlike others who tried hard to please her and get into her good books.

source: 可这裙子的价格，可让少千金小姐都不敢靠近。
en_us: However, the hefty price tag of the dress was far beyond the reach of many daughters of wealthy families too.

source: 可这话一出，孟父直接腿一软，瘫坐在了地上。
en_us: However, as soon as he said that, Meng Fei's father's legs turned into jelly and he sat on the ground.

source: 可这辈子，叶漓再也不愿意为了别人的眼光而束缚自己！
en_us: However, in this life, Ye Li did not want to restrain herself because of the opinions of others anymore!
